{ lib, ... }:

{
  plugins.alpha = {
    enable = true;
    theme = null;

    settings.layout = [
      {
        type = "padding";
        val = 10;
      }
      {
        type = "text";
        val = [
          "                                                      "
          "  ███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗ "
          "  ████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║ "
          "  ██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║ "
          "  ██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║ "
          "  ██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║ "
          "  ╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝ "
          "                                                      "
        ];
        opts = {
          hl = "Type";
          position = "center";
        };
      }
      {
        type = "padding";
        val = 2;
      }
      {
        type = "padding";
        val = 10;
      }
      {
        type = "text";
        val = [
          "“Big things don't affect little things. This is the reason there are no astrology departments in universities.”"
          ""
          "— David Tong"
        ];
        opts = {
          hl = "Comment";
          position = "center";
        };
      }
    ];
  };

  autoCmd = [
    {
      event = [ "FileType" ];
      pattern = [ "alpha" ];
      command = "setlocal nofoldenable";
    }
  ];
}
